//
//  Data.swift
//  hw2_hao
//
//  Created by blaire on 2019/10/18.
//  Copyright © 2019 AppCoda. All rights reserved.
//

import Foundation

let cities = [City(name: "普隆德拉", data: "全稱：盧恩米德加茲王國首都 普隆德拉，是遊戲中最多人來往互動的城市，有著教堂,城堡,騎士團等以北歐神話為背景的遊戲中出現的場所，人際來往中也不乏組隊,商店交易,朋友閒聊等各式互動。"),City(name: "斐揚",data: "全稱：山岳之都 斐揚，又稱弓箭手村，景色風格為韓式古風建築，可以看到茅草房，碾米機等平民事物，也有像宮殿一般的村常住處，在弓箭手公會旁也有練習用的靶場，在更內部的地方則有探險打怪的斐揚洞穴。"),City(name: "吉芬",data: "全稱：魔法之都 吉芬，是坐落于吉芬尼亞盆地上的魔法城市，在城市中央有高聳的吉芬塔，也有為魔法師轉職所設立的魔法師師公會，吉芬塔底下則是適合高等冒險者的地下洞穴。"),City(name: "伊斯魯德島",data:"全稱：衛星都市 伊斯魯德島，是普隆德拉旁附屬的一個小島，設立了劍士工會以及新手訓練場，是遊戲新手地一個抵達的地方，連接著河港，可以由此坐船到艾爾貝塔或是海底洞穴，又或是達成飛空艇前往修發茲共和國的所在區域。"),City(name: "夢羅克",data:"全稱：沙漠之都 夢羅克，是遊戲中盜賊工會的設立處，其中以沙漠設計為主，可以看到金字塔以及人面獅身，雖是盜賊轉職場所又剛好在沙漠中，但實際上景物呈現並沒有太過貧窮。"),City(name: "克魔島",data: "全稱：海邊都市 克魔島，是座落於海蝕洞裡的都市，有著類似不夜城會看到的景色，賭場，絢爛煙火，以及舞孃，完全沒有因為是在洞穴中而淒涼的感覺。"),City(name:"艾爾貝塔",data:"全稱：商人都市 艾爾貝塔，是商人工會的據點，也是全遊戲最大港口的位置，可以從這裡坐船到其他特色區域，整個地圖景物呈現為白色調，和海岸形成了舒適的對比。"),City(name: "艾爾帕蘭",data:"全稱：運河都市 艾爾帕蘭，在城市中設計了不少運河，可以從中看出威尼斯的影子在，而中央是大型鐘塔，是給冒險者挑戰的地點之一，和艾爾貝塔一樣，建築以白色調呈現，不過實際上兩個地方沒有太大關係，在地圖上也不相近。"),City(name: "朱諾",data: "全稱：修發茲共和國首都 朱諾，是遊戲背景中有著大圖書館以及賢者工會的城市，而且整個城市是漂浮於天空之上的，在大圖書館中存放著依美樂之書，是遊戲角色要轉生時所要到達的地方，在圍繞起來的書堆中，閃爍著魔法光芒的依美樂之書，算是我蠻喜歡的一個景點。"),City(name: "毀葛",data: "全稱：田園都市 毀葛，有著田園風景色的都市，也是新的獵人工會的所在地，一旁被丘陵包圍，畫面呈現是舒適的綠色景物。"),City(name: "艾音布羅克",data: "全稱：鋼鐵之都 艾音布羅克，是極度重工業化的城市，畫面呈現是混濁的廢棄，有著運送大量煤礦的採礦列車，也有大量生產的工廠，及帶著口罩的ＮＰＣ。"),City(name: "里希塔樂鎮",data: "全稱：企業之都 里希塔樂鎮，有著類似銀行的建築物，以及擺設華麗的殿堂，設定上內部有著類似研究所的設施，是劇情上相對重要的城市之一。"),City(name: "拉赫",data: "全稱 阿盧納貝茲教皇國首都 拉赫，和同樣是座落於都市的夢羅克比起來，拉赫所呈現出來的感覺就相對貧瘠，而這裡是遊戲中宗教氣息較為濃厚的城市，其拉赫神殿被獨立製作成一張地圖，也有著可愛的年幼教皇以及侍奉他的神官們等ＮＰＣ。"),City(name: "菲音斯",data: "全稱：峽谷村落 菲音斯，位於托爾火山旁的小村落，比起貧瘠感，菲音斯呈現出一種偏遠的感覺，好比都市人看著在山裡的偏鄉人，以遊戲地圖來講，菲音斯也算是較偏遠的一個區域")]
